## 분류

### 서비스 이탈 예측 데이터

In [1]:
import pandas as pd
#데이터 로드
x_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/churnk/X_train.csv")
y_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/churnk/y_train.csv")
x_test= pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/churnk/X_test.csv")


display(x_train.head())
display(y_train.head())

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,15799217,Zetticci,791,Germany,Female,35,7,52436.20,1,1,0,161051.75
1,15748986,Bischof,705,Germany,Male,42,8,166685.92,2,1,1,55313.51
2,15722004,Hsiung,543,France,Female,31,4,138317.94,1,0,0,61843.73
3,15780966,Pritchard,709,France,Female,32,2,0.00,2,0,0,109681.29
4,15636731,Ts'ai,714,Germany,Female,36,1,101609.01,2,1,1,447.73

   CustomerId  Exited
0    15799217       0
1    15748986       0
2    15722004       0
3    15780966       0
4    15636731       0

In [2]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6499 entries, 0 to 6498
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CustomerId       6499 non-null   int64
 1   Surname          6499 non-null   object
 2   CreditScore      6499 non-null   int64
 3   Geography        6499 non-null   object
 4   Gender           6499 non-null   object
 5   Age              6499 non-null   int64
 6   Tenure           6499 non-null   int64
 7   Balance          6499 non-null   float64
 8   NumOfProducts    6499 non-null   int64
 9   HasCrCard        6499 non-null   int64
 10  IsActiveMember   6499 non-null   int64
 11  EstimatedSalary  6499 non-null   float64
dtypes: float64(2), int64(7), object(3)
memory usage: 609.4+ KB

In [4]:
# object로 바꿔주기
x_train['HasCrCard'] = x_train['HasCrCard'].astype('object')
x_train['IsActiveMember'] = x_train['HasCrCard'].astype('object')
x_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6499 entries, 0 to 6498
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CustomerId       6499 non-null   int64
 1   Surname          6499 non-null   object
 2   CreditScore      6499 non-null   int64
 3   Geography        6499 non-null   object
 4   Gender           6499 non-null   object
 5   Age              6499 non-null   int64
 6   Tenure           6499 non-null   int64
 7   Balance          6499 non-null   float64
 8   NumOfProducts    6499 non-null   int64
 9   HasCrCard        6499 non-null   object
 10  IsActiveMember   6499 non-null   object
 11  EstimatedSalary  6499 non-null   float64
dtypes: float64(2), int64(5), object(5)
memory usage: 609.4+ KB

In [5]:
x_test['HasCrCard'] = x_test['HasCrCard'].astype('object')
x_test['IsActiveMember'] = x_test['HasCrCard'].astype('object')
x_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3501 entries, 0 to 3500
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CustomerId       3501 non-null   int64
 1   Surname          3501 non-null   object
 2   CreditScore      3501 non-null   int64
 3   Geography        3501 non-null   object
 4   Gender           3501 non-null   object
 5   Age              3501 non-null   int64
 6   Tenure           3501 non-null   int64
 7   Balance          3501 non-null   float64
 8   NumOfProducts    3501 non-null   int64
 9   HasCrCard        3501 non-null   object
 10  IsActiveMember   3501 non-null   object
 11  EstimatedSalary  3501 non-null   float64
dtypes: float64(2), int64(5), object(5)
memory usage: 328.3+ KB

In [6]:
x_col = x_train.select_dtypes(include='object').columns

In [7]:
x_col

Index(['Surname', 'Geography', 'Gender', 'HasCrCard', 'IsActiveMember'], dtype='object')

In [10]:
for col in x_col:
    print('-----')
    print(x_train[col].nunique())
    print(x_train[col].value_counts())

-----
2289
Brown        21
Scott        20
Shih         20
Smith        19
Martin       19
             ..
Russo         1
Cody          1
Garnsey       1
Voronkov      1
Parkinson     1
Name: Surname, Length: 2289, dtype: int64
-----
3
France     3227
Germany    1650
Spain      1622
Name: Geography, dtype: int64
-----
4
Male      3485
Female    2861
 male       80
female      73
Name: Gender, dtype: int64
-----
2
1    4607
0    1892
Name: HasCrCard, dtype: int64
-----
2
1    4607
0    1892
Name: IsActiveMember, dtype: int64

In [11]:
x_train['Gender'].unique()

array(['Female', 'Male', ' male', 'female'], dtype=object)

In [12]:
# Gender 변수 변환
x_train['Gender'] = x_train['Gender'].replace({' male':'Male','female':'Female'})
x_test['Gender'] = x_test['Gender'].replace({' male':'Male','female':'Female'})

In [14]:
print(x_train['Gender'].value_counts())
print(x_test['Gender'].value_counts())

Male      3565
Female    2934
Name: Gender, dtype: int64
Male      1892
Female    1609
Name: Gender, dtype: int64

In [16]:
x_test['CustomerId']

0       15601012
1       15734762
2       15586757
3       15590888
4       15726087
          ...
3496    15733966
3497    15669994
3498    15712403
3499    15643819
3500    15644962
Name: CustomerId, Length: 3501, dtype: int64

In [19]:
# 데이터 분리
x = x_train.drop(['CustomerId','Surname'],axis=1)
y = y_train['Exited']

test=x_test.drop(['CustomerId','Surname'], axis=1)
customerId=x_test['CustomerId']
x.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,791,Germany,Female,35,7,52436.20,1,1,1,161051.75
1,705,Germany,Male,42,8,166685.92,2,1,1,55313.51
2,543,France,Female,31,4,138317.94,1,0,0,61843.73
3,709,France,Female,32,2,0.00,2,0,0,109681.29
4,714,Germany,Female,36,1,101609.01,2,1,1,447.73

In [20]:
#인코딩
x=pd.get_dummies(x)
test = pd.get_dummies(test)
x.head()

,CreditScore,Age,Tenure,Balance,NumOfProducts,EstimatedSalary,Geography_France,Geography_Germany,Geography_Spain,Gender_Female,Gender_Male,HasCrCard_0,HasCrCard_1,IsActiveMember_0,IsActiveMember_1
0,791,35,7,52436.20,1,161051.75,0,1,0,1,0,0,1,0,1
1,705,42,8,166685.92,2,55313.51,0,1,0,0,1,0,1,0,1
2,543,31,4,138317.94,1,61843.73,1,0,0,1,0,1,0,1,0
3,709,32,2,0.00,2,109681.29,1,0,0,1,0,1,0,1,0
4,714,36,1,101609.01,2,447.73,0,1,0,1,0,0,1,0,1

In [21]:
#검증 데이터분리
from sklearn.model_selection import train_test_split
x_train_set, x_val, y_train_set, y_val = train_test_split(x,y,stratify=y, test_size=0.3, random_state=42)

In [25]:
#모델 적합(RF)
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import roc_auc_score

rf=RandomForestClassifier(n_estimators=200, max_depth=6, criterion='gini', random_state=42)
rf.fit(x_train_set, y_train_set)
y_pred_prob=rf.predict_proba(x_val)[:,1]

In [26]:
#"entropy"
print("roc_auc_score:", roc_auc_score(y_val, y_pred_prob))

roc_auc_score: 0.832877294454059

In [27]:
#테스트모델 적합
rf.fit(x,y)
test_pred_prob = rf.predict_proba(test)[:,1]
test_pred_prob

array([0.41223909, 0.71100857, 0.13268081, ..., 0.45320936, 0.08773334,
       0.09235647])

In [29]:
#submission 제출
#submission = pd.DataFrame({'CustomerId':CustomerId, 'Exited':test_pred_prob})
#submission.to_csv('submission.csv', index=False)

### 이직여부 판단 데이터

In [30]:
import pandas as pd
#데이터 로드
x_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/HRdata/X_train.csv")
y_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/HRdata/y_train.csv")
x_test= pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/HRdata/X_test.csv")


display(x_train.head())
display(y_train.head())

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,25298,city_138,0.836,Male,No relevent experience,Full time course,High School,NaN,5,100-500,Pvt Ltd,1,45
1,4241,city_160,0.920,Male,No relevent experience,Full time course,High School,NaN,5,NaN,NaN,1,17
2,24086,city_57,0.866,Male,No relevent experience,no_enrollment,Graduate,STEM,10,NaN,NaN,1,50
3,26773,city_16,0.910,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,>4,135
4,32325,city_143,0.740,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,17

   enrollee_id  target
0        25298     0.0
1         4241     1.0
2        24086     0.0
3        26773     0.0
4        32325     1.0

In [31]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12452 entries, 0 to 12451
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             12452 non-null  int64
 1   city                    12452 non-null  object
 2   city_development_index  12452 non-null  float64
 3   gender                  9535 non-null   object
 4   relevent_experience     12452 non-null  object
 5   enrolled_university     12195 non-null  object
 6   education_level         12137 non-null  object
 7   major_discipline        10586 non-null  object
 8   experience              12415 non-null  object
 9   company_size            8600 non-null   object
 10  company_type            8471 non-null   object
 11  last_new_job            12179 non-null  object
 12  training_hours          12452 non-null  int64
dtypes: float64(1), int64(2), object(10)
memory usage: 1.2+ MB

In [32]:
y_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12452 entries, 0 to 12451
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   enrollee_id  12452 non-null  int64
 1   target       12452 non-null  float64
dtypes: float64(1), int64(1)
memory usage: 194.7 KB

In [33]:
#결측치 확인
x_train.isnull().sum()

enrollee_id                  0
city                         0
city_development_index       0
gender                    2917
relevent_experience          0
enrolled_university        257
education_level            315
major_discipline          1866
experience                  37
company_size              3852
company_type              3981
last_new_job               273
training_hours               0
dtype: int64

In [34]:
x_test.isnull().sum()

enrollee_id                  0
city                         0
city_development_index       0
gender                    1591
relevent_experience          0
enrolled_university        129
education_level            145
major_discipline           947
experience                  28
company_size              2086
company_type              2159
last_new_job               150
training_hours               0
dtype: int64

In [ ]:
# 둘 다 결측치가 너무 많네

In [35]:
#범주형 데이터 확인
for col in x_train.select_dtypes('object').columns:
    print(f"{col}:{x_train[col].unique()}")

city:['city_138' 'city_160' 'city_57' 'city_16' 'city_143' 'city_105'
 'city_102' 'city_136' 'city_103' 'city_21' 'city_114' 'city_81' 'city_64'
 'city_67' 'city_1' 'city_75' 'city_144' 'city_100' 'city_12' 'city_50'
 'city_118' 'city_61' 'city_97' 'city_71' 'city_70' 'city_90' 'city_11'
 'city_149' 'city_98' 'city_73' 'city_23' 'city_99' 'city_9' 'city_162'
 'city_14' 'city_40' 'city_77' 'city_7' 'city_104' 'city_65' 'city_89'
 'city_173' 'city_152' 'city_28' 'city_123' 'city_91' 'city_145'
 'city_159' 'city_116' 'city_150' 'city_19' 'city_83' 'city_45' 'city_78'
 'city_115' 'city_76' 'city_155' 'city_74' 'city_101' 'city_46' 'city_24'
 'city_146' 'city_44' 'city_111' 'city_42' 'city_158' 'city_128'
 'city_165' 'city_36' 'city_79' 'city_18' 'city_93' 'city_20' 'city_2'
 'city_10' 'city_141' 'city_72' 'city_41' 'city_134' 'city_27' 'city_107'
 'city_175' 'city_37' 'city_94' 'city_62' 'city_13' 'city_53' 'city_69'
 'city_176' 'city_84' 'city_30' 'city_126' 'city_26' 'city_167' 'city_25'
 'city_48' 'city_59' 'city_131' 'city_8' 'city_33' 'city_142' 'city_109'
 'city_157' 'city_80' 'city_43' 'city_82' 'city_133' 'city_120' 'city_139'
 'city_180' 'city_117' 'city_54' 'city_121' 'city_129' 'city_31' 'city_39'
 'city_127' 'city_179' 'city_55' 'city_106' 'city_166' 'city_140']
gender:['Male' nan 'Female' 'Other']
relevent_experience:['No relevent experience' 'Has relevent experience']
enrolled_university:['Full time course' 'no_enrollment' 'Part time course' nan]
education_level:['High School' 'Graduate' 'Primary School' 'Masters' 'Phd' nan]
major_discipline:[nan 'STEM' 'Other' 'Humanities' 'No Major' 'Business Degree' 'Arts']
experience:['5' '10' '>20' '6' '14' '20' '7' '9' '8' '4' '3' '13' '16' '2' '12' '15'
 '11' '1' '<1' '17' '18' nan '19']
company_size:['100-500' nan '50-99' '10/49' '10000+' '1000-4999' '<10' '500-999'
 '5000-9999']
company_type:['Pvt Ltd' nan 'Public Sector' 'NGO' 'Funded Startup'
 'Early Stage Startup' 'Other']
last_new_job:['1' '>4' 'never' '2' '4' '3' nan]

In [43]:
#4분위수를 이용한 이상값 확인
for col in x_train.select_dtypes(exclude='object').columns:
    Q1 = x_train[col].quantile(.25)
    Q3 = x_train[col].quantile(.75)
    IQR =Q3 -Q1
    print(col, len(x_train[(x_train[col]<Q1-IQR*1.5) | (x_train[col]>Q3+IQR*1.5)][col]))

enrollee_id 0
city_development_index 14
training_hours 652

In [44]:
#마찬가지로 x_test에서도 4분위수를 이용한 이상값 확인
for col in x_test.select_dtypes(exclude='object').columns:
    Q1 = x_test[col].quantile(.25)
    Q3 = x_test[col].quantile(.75)
    IQR =Q3 -Q1
    print(col, len(x_test[(x_test[col]<Q1-IQR*1.5) | (x_test[col]>Q3+IQR*1.5)][col]))

enrollee_id 0
city_development_index 3
training_hours 332

In [ ]:
# 일단은 캐글에 올라온 내용을 보면서 결측치 처리하기
# 여러개를 보면서 따라해보려고 했으나 결측치 처리하는게 너무 복잡해서 따라 치다가 응용을 못할 것 같아 가장 간단한걸로 먼저 연습하기
# [PY]RF(test AUC:0.7555)

In [ ]:
# NaN 값이 너무 많이서 일단 최빈값으로 모두 대체

In [45]:
x_train.isna().any()

enrollee_id               False
city                      False
city_development_index    False
gender                     True
relevent_experience       False
enrolled_university        True
education_level            True
major_discipline           True
experience                 True
company_size               True
company_type               True
last_new_job               True
training_hours            False
dtype: bool

In [47]:
#최빈값 구하기
x_train[col].mode()[0]

28

In [46]:
def fill_mode(df):
    for col in df.columns[df.isna().any()].tolist():
        df[col] = df[col].fillna(df[col].mode()[0]) 
    return df

In [48]:
x_train = fill_mode(x_train)
x_test = fill_mode(x_test)
print(x_train.isna().sum())

enrollee_id               0
city                      0
city_development_index    0
gender                    0
relevent_experience       0
enrolled_university       0
education_level           0
major_discipline          0
experience                0
company_size              0
company_type              0
last_new_job              0
training_hours            0
dtype: int64

In [50]:
train_id

       enrollee_id
0            25298
1             4241
2            24086
3            26773
4            32325
...            ...
12447        29597
12448        27821
12449        21812
12450        28416
12451        31875

[12452 rows x 1 columns]

In [49]:
#Drop enrollee_id
drop_col = ['enrollee_id']
train_id = x_train[drop_col]
test_id = x_test[drop_col]

x_train = x_train.drop(drop_col, axis=1)
x_test = x_test.drop(drop_col, axis=1)
print(train_id.shape, test_id.shape)

(12452, 1) (6706, 1)

In [51]:
#범주형 데이터 확인
for col in x_train.select_dtypes('object').columns:
    print(f"{col}:{x_train[col]}")

city:0        city_138
1        city_160
2         city_57
3         city_16
4        city_143
           ...
12447     city_21
12448    city_103
12449    city_160
12450    city_160
12451    city_136
Name: city, Length: 12452, dtype: object
gender:0          Male
1          Male
2          Male
3          Male
4          Male
          ...
12447      Male
12448      Male
12449    Female
12450      Male
12451      Male
Name: gender, Length: 12452, dtype: object
relevent_experience:0         No relevent experience
1         No relevent experience
2         No relevent experience
3        Has relevent experience
4         No relevent experience
                  ...
12447    Has relevent experience
12448    Has relevent experience
12449    Has relevent experience
12450    Has relevent experience
12451     No relevent experience
Name: relevent_experience, Length: 12452, dtype: object
enrolled_university:0        Full time course
1        Full time course
2           no_enrollment
3           no_enrollment
4        Full time course
               ...
12447       no_enrollment
12448       no_enrollment
12449       no_enrollment
12450    Full time course
12451    Full time course
Name: enrolled_university, Length: 12452, dtype: object
education_level:0        High School
1        High School
2           Graduate
3           Graduate
4           Graduate
            ...
12447       Graduate
12448       Graduate
12449       Graduate
12450       Graduate
12451       Graduate
Name: education_level, Length: 12452, dtype: object
major_discipline:0        STEM
1        STEM
2        STEM
3        STEM
4        STEM
         ...
12447    STEM
12448    STEM
12449    STEM
12450    STEM
12451    STEM
Name: major_discipline, Length: 12452, dtype: object
experience:0          5
1          5
2         10
3        >20
4          5
        ...
12447     <1
12448    >20
12449      6
12450     10
12451      4
Name: experience, Length: 12452, dtype: object
company_size:0        100-500
1          50-99
2          50-99
3          50-99
4          50-99
          ...
12447      50-99
12448     10000+
12449      50-99
12450      50-99
12451      50-99
Name: company_size, Length: 12452, dtype: object
company_type:0        Pvt Ltd
1        Pvt Ltd
2        Pvt Ltd
3        Pvt Ltd
4        Pvt Ltd
          ...
12447    Pvt Ltd
12448    Pvt Ltd
12449    Pvt Ltd
12450    Pvt Ltd
12451    Pvt Ltd
Name: company_type, Length: 12452, dtype: object
last_new_job:0            1
1            1
2            1
3           >4
4        never
         ...
12447        1
12448       >4
12449        1
12450        2
12451        1
Name: last_new_job, Length: 12452, dtype: object

In [53]:
#label encoding을 위해 train test 데이터 merge
print(x_train.shape, x_test.shape)
x_df = pd.concat([x_train, x_test], axis=0)

(12452, 12) (6706, 12)

In [55]:
object_cols = x_df.select_dtypes(include=object).columns
not_object_cols = x_df.select_dtypes(exclude=object).columns
print(not_object_cols)

Index(['city_development_index', 'training_hours'], dtype='object')

###

In [58]:
#label encoding
from sklearn.preprocessing import LabelEncoder
def label_encoding(df,cols):
    for col in cols:
        le = LabelEncoder()
        le.fit(df[col])
        x_train[col] = le.transform(x_train[col])
        x_test[col] = le.transform(x_test[col])

In [59]:
label_encoding(x_df, object_cols)
x_train.head()

,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,31,0.836,1,1,0,1,5,15,1,5,0,45
1,49,0.920,1,1,0,1,5,15,4,5,0,17
2,89,0.866,1,1,2,0,5,1,4,5,0,50
3,48,0.910,1,0,2,0,5,21,4,5,4,135
4,37,0.740,1,1,0,0,5,15,4,5,5,17

In [61]:
from sklearn.model_selection import train_test_split
train_target = y_train['target']
x_train_sp, x_valid_sp, y_train_sp, y_valid_sp = train_test_split(x_train,train_target, test_size=0.33, stratify=train_target, random_state=456 )

In [86]:
from sklearn.ensemble import RandomForestClassifier

rf = RandomForestClassifier(random_state=456)
rf.fit(x_train_sp, y_train_sp)
pred_proba = rf.predict_proba(x_valid_sp)[:, 1]
print(pred_proba)

[0.3        0.1        0.7        ... 0.5        0.2        0.26666667]

C:\Users\HJ\Anaconda3\lib\site-packages\sklearn\ensemble\forest.py:245: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)

In [87]:
pred_proba

array([0.3       , 0.1       , 0.7       , ..., 0.5       , 0.2       ,
       0.26666667])

In [88]:
#AUC 확인
from sklearn.metrics import roc_auc_score

auc_train = roc_auc_score(y_valid_sp, pred_proba)
print(auc_train)

0.7198567419061548

In [89]:
# 테스트 데이터 산출
test_pred_proba = rf.predict_proba(x_test)[:,1]

In [90]:
#submit 

save_num = '1234.csv'

sub = pd.DataFrame({'enrollee_id':test_id['enrollee_id'], 'target':test_pred_proba})

In [ ]:
#sub.to_csv(save_num, index=False)

In [92]:
sub.head()

   enrollee_id  target
0         7129     0.5
1        31037     0.2
2        22179     0.1
3        29724     0.4
4        17977     0.6